start_msg ="""
Привет!👋
Я Random Coffee бот для SHELL CLUB 🤖

Каждую неделю я буду предлагать тебе собеседника из сообщества, которого алгоритм посчитает самым интересным для встречи.

Чтобы принять участие во встречах, нужно заполнить анкету.💡 
Если что, ты всегда сможешь поменять данные профиля с помощью команды /help
"""

name_question = """
1/5. ☕️ Как тебя зовут? Напиши имя и фамилию.
"""

city_question = """
2/9.📍Из какого ты города? Выбери или напиши в ответ.

Вы с партнером можете оказаться в разных городах – тогда вам подойдет онлайн формат встречи 👨‍💻
Если вы из одного города – сможете встретиться вживую 🤝
"""

link_question = """
3/9. 👨‍💻 Пришли ссылку на профиль в соцсетях, который активно ведешь.
💡 Ты можешь оставить ссылку на конкретный пост о себе или даже интервью — что-то, что поможет человеку заочно познакомиться с тобой до первой встречи. 

🔗 Оставляй сразу ссылку, по которой можно будет кликнуть. ❌ "Мой никнейм в инсте – "kukushe4ka" – придётся набирать в поиске, это неудобно.
"""

job_question = """
2/5. 👨‍🔬 Кем ты работаешь и чем занимаешься?
"""

job_area_question = """
5/9. 👩🏻‍💻 Укажи, в какой сфере ты работаешь?
"""

hobby_question = """
3/5. 👀 Какие у тебя есть рабочие и нерабочие интересы?

💡 Напиши через запятую слова, за которые можно зацепиться и развернуть из этого интересный разговор :) Например, увлечения, города, названия книг.
"""

birth_day_question = """
7/9. 📅 Напиши дату рождения в формате дд.мм.гггг.
"""

motivation_question = """
4/5. ⚖️ Некоторые люди приходят на Random Coffee встречи, 
чтобы найти партнёров для будущих проектов и 
завести полезные контакты, условно назовём это "пользой". 
А кто-то приходит для расширения кругозора, новых эмоций и открытия чего-то нового, назовём это "фан". 

Какое описание больше подходит тебе?
"""

meeting_format_question = """
5/5. ☕️ В каком формате хочешь ее провести: вживую или онлайн?
"""

result_info = """
Получилось! 🙌

Теперь ты — участник встреч Random Coffee ☕

Вот так будет выглядеть твой профиль в сообщении, которое мы пришлем твоему собеседнику:
⏬
"""

go_button = "Поехали 🚀"

spb_button = "Санкт-Петербург 🏛"

link_error = """
❌ Ссылка некорректная. Попробуй еще 😇
"""

date_error = """
❌ Дата некорректная. Попробуй еще 😇
"""

empty_profile_msg = """
Привет! 💖
Похоже, что твоей анкеты еще нет. Необходимо заполнить ее! 😉

Просто следуй инструкциям и ответь на несколько вопросов.
Это займет несколько минут. 🚀

Ждем с нетерпением узнать тебя получше! 🤗

Нажми на кнопку "Анкета" ниже, чтобы начать. 👇
"""

emoji_list = [ "🐌", "🐍", "🐎", "🐑", "🐒", "🐘", "🐙", "🐚", "🐛", "🐝", 
                "🐞", "🐟", "🐠", "🐡", "🐢", "🐣", "🐤", "🐥", "🐦", "🐧",
                "🐨", "🐩", "🐫", "🐬", "🐭", "🐮", "🐯", "🐰", "🐱", "🐲",
                "🐳", "🐴", "🐵", "🐶", "🐷", "🐸", "🐹", "🐺", "🐻", "🐼",
                "🐾", "👄", "👑", "👒", "💄", "🐋", "🎀", "🍀", "🌿", "🌾",
                "🌺", "🌻", "🌸", "🌷", "🌱", 
                ]

help_msg ="""
Привет! 💖

Ты можешь воспользоваться следующими командами:

/start          Начало 🌾
/profile        Посмотреть, как выглядит твой профиль 📃
/acquaintance   Заполнить анкету или обновить информацию о себе 💬
/help           Посмотреть список всех команд 📋
"""